ZbigniewKuz/Autonomic-vehicle-with-LIDAR/STM32 - main program/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Yellow_Pin GPIO_PIN_4
#define Yellow_GPIO_Port GPIOE
#define Motor_1_dir_Pin GPIO_PIN_4
#define Motor_1_dir_GPIO_Port GPIOA
#define Motor_2_dir_Pin GPIO_PIN_5
#define Motor_2_dir_GPIO_Port GPIOA
#define Motor_1_PWM_Pin GPIO_PIN_6
#define Motor_1_PWM_GPIO_Port GPIOA
#define Motor_2_PWM_Pin GPIO_PIN_7
#define Motor_2_PWM_GPIO_Port GPIOA
#define Motor_3_dir_Pin GPIO_PIN_4
#define Motor_3_dir_GPIO_Port GPIOC
#define Motor_4_dir_Pin GPIO_PIN_5
#define Motor_4_dir_GPIO_Port GPIOC
#define Motor_3_PWM_Pin GPIO_PIN_0
#define Motor_3_PWM_GPIO_Port GPIOB
#define Motor_4_PWM_Pin GPIO_PIN_1
#define Motor_4_PWM_GPIO_Port GPIOB
#define Blue_Pin GPIO_PIN_0
#define Blue_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
